src/Reports/ДокладнаяЗаписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ДокладнаяЗаписка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТрудовогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоОсновнымДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ТрудовыеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТрудовыеДоговора</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровСФизЛицами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеТрудовогоДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТрудовогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоКонтракту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиВОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипТрудовогоДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипТрудовогоДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДоговоровСФизЛицами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровСФизЛицами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контракт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подряда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Авторский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорУправленческий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/ДокладнаяЗаписка/Ext/ObjectModule.bsl
Перем мМакет, мНомер;
Перем ТЗ;

#Если Клиент Тогда

// Функция склоняет переданую фразу
// Параметры:
//  Фраза (обязательный), тип строка
//   Параметр должен содержать фразу. Каждое слово фразы будет просклонено отдельно
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
Функция ПросклонятьСтр(Компонента, Знач Фраза = "", Падеж = 1, Пол = Неопределено)
	
	Результат = "";
	
	#Если Клиент Тогда
		
	МассивСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Фраза, " ");
	
	Для Каждого СтрокаМассива Из МассивСтрок Цикл
		Если ПустаяСтрока(СтрокаМассива) ИЛИ НЕ РегламентированнаяОтчетность.ФИОНаписаноВерно(СтрокаМассива) Тогда
			Результат = Результат + СтрокаМассива + " ";
			Продолжить;
		КонецЕсли;
		
		Попытка
			Результат = Результат + Компонента.Просклонять(СтрокаМассива, Падеж) + " ";
			
		Исключение
			Результат = Фраза;
			Возврат Ложь;
			
		КонецПопытки;
			
	КонецЦикла;
	
	Результат = СокрЛП(Результат);
	
	Возврат Результат;
	
	#Иначе
		
	Возврат Ложь;
	
	#КонецЕсли
	
КонецФункции // Просклонять()

// <Описание функции>
//возвращаемого значения>
//
Функция СформируемЗапросПоЗаключенномуКонтракту(ВыбСотрудник)
  	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДействиеТрудовогоДоговора",Перечисления.ТипТрудовогоДоговора.Заключен);
    Запрос.УстановитьПараметр("Сотрудник",ВыбСотрудник);
	Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.Контракт);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ТрудовыеДоговораСрезПоследних.НачалоДоговора,
	|	ТрудовыеДоговораСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговораСрезПоследних
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговораСрезПоследних.Сотрудник
	|ГДЕ
	|   ТрудовыеДоговораСрезПоследних.Сотрудник = &Сотрудник 
	|	И ТрудовыеДоговораСрезПоследних.ДействиеТрудовогоДоговора = &ДействиеТрудовогоДоговора
	|	И ТрудовыеДоговораСрезПоследних.ВидДоговора = &ВидДоговора";

	РезультатЗапроса = Запрос.Выполнить();
    Возврат РезультатЗапроса;
КонецФункции // СформируемЗапросПоЗаключенномуКонтракту(ВыбСотрудник)()
	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокКонтракта, ДокументРезультат)
  
	Пока ВыборкаСтрокКонтракта.Следующий() Цикл 
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокКонтракта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		//Аверсон 28.02.2022 КВВ СВФР-008797 (пункт 3) (
		Если СокрЛП(Организация.ИНН) = "700067572" Тогда
		Если ВыводитьПоОсновнымДоговорам Тогда
			Если ВыборкаСтрокКонтракта.Регистратор <> ВыборкаСтрокКонтракта.Сотрудник.ТрудовойДоговор Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		КонецЕсли;
		//Аверсон 28.02.2022 КВВ СВФР-008797 (пункт 3) )
		
		ПолныхЛет = 0; Год = 0;  НачалоЗаключенногоКонтракта = Дата(1,1,1);
		
		//найдем последний заключенный контракт
		ЗаключенныйКонтракт = СформируемЗапросПоЗаключенномуКонтракту(ВыборкаСтрокКонтракта.Сотрудник).Выбрать();
		Пока ЗаключенныйКонтракт.Следующий() Цикл
			НачалоЗаключенногоКонтракта = ЗаключенныйКонтракт.НачалоДоговора;
		КонецЦикла; 
		
		//подсчет максимальное продление контракта
		Если НачалоЗаключенногоКонтракта <> Дата(1,1,1) Тогда
			Лет = 0;
			Месяцев = 0;
			Дней = 0; 
			ОбщегоНазначения.РазобратьРазностьДат(ВыборкаСтрокКонтракта.ОкончаниеДоговора + 86400,НачалоЗаключенногоКонтракта, Лет, Месяцев, Дней);
			Если Лет < 5 Тогда
				ПолныхЛет = 5 - Лет;
			Иначе
				ПолныхЛет = 5;
			КонецЕсли;
		КонецЕсли;
		//Если ПолныхЛет <> 0 Тогда
		мНомер = мНомер + 1;
		ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
		ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
		ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокКонтракта.Сотрудник.Наименование;				
		ОбластьДетальныхЗаписей.Параметры.ПодразделениеКод = СокрЛП(ВыборкаСтрокКонтракта.ПодразделениеОрганизацииКод);
		ОбластьДетальныхЗаписей.Параметры.ПодразделениеНаименование = НРег(ВыборкаСтрокКонтракта.ПодразделениеОрганизацииНаименование);
		ОбластьДетальныхЗаписей.Параметры.Должность = НРег(ВыборкаСтрокКонтракта.Должность);
		ОбластьДетальныхЗаписей.Параметры.ОкончаниеКонтракта = ВыборкаСтрокКонтракта.ОкончаниеДоговора;
		ОбластьДетальныхЗаписей.Параметры.ПроцентПоКонтракту = ВыборкаСтрокКонтракта.ПроцентПоКонтракту;
		Лет = 0;
		Месяцев = 0;
		Дней = 0; 
		ОбщегоНазначения.РазобратьРазностьДат(РабочаяДата,ВыборкаСтрокКонтракта.Сотрудник.Физлицо.ДатаРождения, Лет, Месяцев, Дней);
		ОбластьДетальныхЗаписей.Параметры.Возраст = Лет;			
		ОбластьДетальныхЗаписей.Параметры.ПродлениеКонтракта = ПолныхЛет;	
		ОбластьДетальныхЗаписей.Параметры.Тип = ВыборкаСтрокКонтракта.Регистратор.ТипТрудовогоДоговора;	
		ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
		
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		//КонецЕсли;
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	
	//найдем ответственное лицо = руководитель и руководитель кадровой службы
	РуководительФИО =""; РуководительОКФИО = "";
	СпрОрганизации = Организация.ПолучитьОбъект();
	ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	ТЗ.Сортировать("Дата Убыв"); НашлиОК = 0; Нашли = 0;
	Для Каждого НоваяСтр из ТЗ Цикл
		Если РабочаяДата >= НоваяСтр.Дата Тогда
			РезультатСклонения = ""; ФИО = "";
			Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель и Нашли = 0 Тогда
				Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),НоваяСтр.Сотрудник.Наименование, 3, НоваяСтр.Сотрудник.Физлицо.Пол, РезультатСклонения) Тогда
					ФИО = РезультатСклонения;	
				КонецЕсли;
				РуководительФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИО);
				Нашли = 1;
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы и НашлиОК = 0 Тогда
				РуководительОКФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(НоваяСтр.Сотрудник.Наименование);			
				НашлиОК = 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	
 	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,	
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ТрудовыеДоговора.Период,
	|	ТрудовыеДоговора.Регистратор,
	|	ТрудовыеДоговора.Сотрудник КАК Сотрудник,
	|	ТрудовыеДоговора.ВидДоговора,
	|	ТрудовыеДоговора.НомерТД,
	|	ТрудовыеДоговора.ДействиеТрудовогоДоговора,
	|	ТрудовыеДоговора.НачалоДоговора,
	|	ТрудовыеДоговора.ОкончаниеДоговора,
	|	ТрудовыеДоговора.ПроцентПоКонтракту
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период,) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговора
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговора.Сотрудник
	//|		И РаботникиОрганизацийСрезПоследних.Сотрудник.ТрудовойДоговор = ТрудовыеДоговора.Регистратор //Аверсон 27.11.2019 КВВ СВФР-005128 (Закомментировано)
	|ГДЕ
	|	ТрудовыеДоговора.ОкончаниеДоговора >= &НачалоПериода
	|	И ТрудовыеДоговора.ОкончаниеДоговора <= &ОкончаниеПериода
	|   И ТрудовыеДоговора.ВидДоговора = &ВидДоговора
	|   И РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0	
  	|   И РаботникиОрганизацийСрезПоследних.Организация = &Организация
	
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеОрганизацииКод,
	|	ПодразделениеОрганизацииНаименование,
	|	Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачПериод);
	Запрос.УстановитьПараметр("ОкончаниеПериода",КонПериод);
	Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.Контракт);
	Запрос.УстановитьПараметр("Подразделение",      Подразделение);
	Запрос.УстановитьПараметр("Организация",      Организация);
	Запрос.УстановитьПараметр("Период",      РабочаяДата);

	
	Если Не Подразделение.Пустая() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Организация = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)")
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;

	Результат = Запрос.Выполнить();
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.ФИО_Директора = РуководительФИО;
	Область.Параметры.ФИО_НачальникаОК = РуководительОКФИО;
	Область.Параметры.ДатаОтчета = Формат(ОбщегоНазначения.ПолучитьРабочуюДату(),"ДФ=dd.MM.yyyy");
	Стр = ПросклонятьСтр(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(НачПериод), "ДФ=""ММММ.гггг"""), 6, );
	Область.Параметры.ДатаМесяцГод = НРег(Стр);
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

мМакет = ПолучитьМакет("МакетОтчета");

#КонецЕсли
